ElementalMFG/ecosystem/firmware/sdkconfig.defaults
# SPDX-License-Identifier: Apache-2.0
# SS-SP Lite (ESP32-S3-WROOM-1-N16R8) build defaults.
# See 01_SS-SP_LITE_HARDWARE_REFERENCE.md §4.1.

CONFIG_IDF_TARGET="esp32s3"

# --- Flash: 16 MB, custom A/B OTA partition table ---------------------------
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# --- PSRAM: 8 MB Octal @ 80 MHz ---------------------------------------------
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=4096

# --- Console on native USB-Serial-JTAG (frees UART1/UART2 for modules) ------
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y

# --- RTOS / performance ------------------------------------------------------
CONFIG_FREERTOS_HZ=1000
CONFIG_COMPILER_OPTIMIZATION_PERF=y
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192

# --- Production hardening (enable on release builds; see EPIC-08) -----------
# CONFIG_SECURE_BOOT=y
# CONFIG_SECURE_FLASH_ENC_ENABLED=y
